Import the necessary libraries.

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

Read the two datasets

In [31]:
dataset_1 = pd.read_csv("online_retail_data.csv", low_memory=False)
dataset_2 = pd.read_csv("online_retail_data_2.csv", low_memory=False)

Check the dataset and shape for successful read im the notebook.

In [36]:
print(dataset_1.shape)
dataset_1.head(3)

(939733, 8)

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country
0,489434,85048,15CM CHRISTMAS GLASS BALL 20 LIGHTS,12,12/1/2009 7:45,6.95,13085.0,United Kingdom
1,489434,79323P,PINK CHERRY LIGHTS,12,12/1/2009 7:45,6.75,13085.0,United Kingdom
2,489434,79323W,WHITE CHERRY LIGHTS,12,12/1/2009 7:45,6.75,13085.0,United Kingdom

In [37]:
print(dataset_2.shape)
dataset_2.head(3)

(901814, 8)

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom

Combine the dataset in to one and compare the shape.

In [38]:
combine_data = pd.concat([dataset_1, dataset_2], ignore_index=True)
print(combine_data.shape)
combine_data.head(3)

(1841547, 8)

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country
0,489434,85048,15CM CHRISTMAS GLASS BALL 20 LIGHTS,12,12/1/2009 7:45,6.95,13085.0,United Kingdom
1,489434,79323P,PINK CHERRY LIGHTS,12,12/1/2009 7:45,6.75,13085.0,United Kingdom
2,489434,79323W,WHITE CHERRY LIGHTS,12,12/1/2009 7:45,6.75,13085.0,United Kingdom

In [6]:
print(combine_data.shape, dataset_1.shape, dataset_2.shape)

(1841547, 8) (939733, 8) (901814, 8)

# Data Cleaning <br>

check basic information about the data

In [7]:
combine_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1841547 entries, 0 to 1841546
Data columns (total 8 columns):
 #   Column       Dtype
---  ------       -----
 0   Invoice      object
 1   StockCode    object
 2   Description  object
 3   Quantity     int64
 4   InvoiceDate  object
 5   Price        float64
 6   Customer ID  float64
 7   Country      object
dtypes: float64(2), int64(1), object(5)
memory usage: 112.4+ MB

In [8]:
combine_data.describe()

           Quantity         Price   Customer ID
count  1.841547e+06  1.841547e+06  1.400928e+06
mean   1.004666e+01  4.739930e+00  1.532534e+04
std    1.636852e+02  1.272806e+02  1.701396e+03
min   -8.099500e+04 -5.359436e+04  1.234600e+04
25%    1.000000e+00  1.250000e+00  1.396300e+04
50%    3.000000e+00  2.100000e+00  1.525500e+04
75%    1.000000e+01  4.210000e+00  1.680900e+04
max    8.099500e+04  3.897000e+04  1.828700e+04

In [9]:
combine_data["Customer ID"] = combine_data["Customer ID"].astype(str)
combine_data["Customer ID"].head()

0    13085.0
1    13085.0
2    13085.0
3    13085.0
4    13085.0
Name: Customer ID, dtype: object

In [10]:
combine_data["Customer ID"] = combine_data["Customer ID"].str.replace(".0", "")
combine_data["Customer ID"].head()

0    13085
1    13085
2    13085
3    13085
4    13085
Name: Customer ID, dtype: object

In [11]:
combine_data.dtypes

Invoice         object
StockCode       object
Description     object
Quantity         int64
InvoiceDate     object
Price          float64
Customer ID     object
Country         object
dtype: object

In [12]:
has_time = combine_data[combine_data["InvoiceDate"].str.contains(":")]
without_time = combine_data[~combine_data["InvoiceDate"].str.contains(":")]

In [13]:
has_time = has_time.copy()
without_time = without_time.copy()

In [14]:
has_time["InvoiceDate"] = pd.to_datetime(has_time["InvoiceDate"])
without_time["InvoiceDate"] = pd.to_datetime(without_time["InvoiceDate"])

In [15]:
without_time

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country
525461,489434,85048,15CM CHRISTMAS GLASS BALL 20 LIGHTS,12,2009-12-01,6.95,13085,United Kingdom
525462,489434,NaN,PINK CHERRY LIGHTS,12,2009-12-01,6.75,13085,United Kingdom
525463,489434,NaN,WHITE CHERRY LIGHTS,12,2009-12-01,6.75,13085,United Kingdom
525464,489434,22041,"RECORD FRAME 7"" SINGLE SIZE",48,2009-12-01,2.10,13085,United Kingdom
525465,489434,21232,STRAWBERRY CERAMIC TRINKET BOX,24,2009-12-01,1.25,13085,United Kingdom
...,...,...,...,...,...,...,...,...
1841542,540976.0,21875,KINGS CHOICE MUG,12,2011-01-12,1.25,12652,France
1841543,540976.0,21908,CHOCOLATE THIS WAY METAL SIGN,12,2011-01-12,2.10,12652,France
1841544,540976.0,21877,HOME SWEET HOME MUG,12,2011-01-12,1.25,12652,France
1841545,540976.0,22406,MONEY BOX KINGS CHOICE DESIGN,12,2011-01-12,1.25,12652,France
1841546,540976.0,85015,SET OF 12 VINTAGE POSTCARD SET,6,2011-01-12,2.55,12652,France

In [16]:
has_time["Time"] = has_time["InvoiceDate"].dt.time

In [17]:
has_time.head()

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country,Time
0,489434,85048,15CM CHRISTMAS GLASS BALL 20 LIGHTS,12,2009-12-01 07:45:00,6.95,13085,United Kingdom,07:45:00
1,489434,79323P,PINK CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085,United Kingdom,07:45:00
2,489434,79323W,WHITE CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085,United Kingdom,07:45:00
3,489434,22041,"RECORD FRAME 7"" SINGLE SIZE",48,2009-12-01 07:45:00,2.10,13085,United Kingdom,07:45:00
4,489434,21232,STRAWBERRY CERAMIC TRINKET BOX,24,2009-12-01 07:45:00,1.25,13085,United Kingdom,07:45:00

In [18]:
has_time.shape, without_time.shape

((1067371, 9), (774176, 8))

In [19]:
date_count = has_time.pivot_table(values="Customer ID", index=["Country", "Time"], aggfunc="count")
max_data = date_count.groupby("Country")["Customer ID"].idxmax()
date_count = date_count.loc[max_data].reset_index()
date_count.head()

     Country      Time  Customer ID
0  Australia  13:37:00          139
1    Austria  14:34:00           75
2    Bahrain  14:48:00           29
3    Belgium  12:04:00           75
4    Bermuda  10:20:00           34

In [20]:
country_time_map = date_count.set_index("Country")["Time"].to_dict()
without_time["Time"] = without_time["Country"].map(country_time_map)
without_time.Time

525461     14:41:00
525462     14:41:00
525463     14:41:00
525464     14:41:00
525465     14:41:00
             ...
1841542    14:52:00
1841543    14:52:00
1841544    14:52:00
1841545    14:52:00
1841546    14:52:00
Name: Time, Length: 774176, dtype: object

In [21]:
without_time["InvoiceDate"] = without_time["InvoiceDate"].astype(str)
without_time["Time"] = without_time["Time"].astype(str)

without_time["Datetime"] = pd.to_datetime(without_time["InvoiceDate"]+ " "+without_time["Time"])
has_time["Datetime"] = has_time["InvoiceDate"]

In [22]:
combine_data = pd.concat([has_time, without_time], ignore_index=True)
combine_data.head()

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country,Time,Datetime
0,489434,85048,15CM CHRISTMAS GLASS BALL 20 LIGHTS,12,2009-12-01 07:45:00,6.95,13085,United Kingdom,07:45:00,2009-12-01 07:45:00
1,489434,79323P,PINK CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085,United Kingdom,07:45:00,2009-12-01 07:45:00
2,489434,79323W,WHITE CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085,United Kingdom,07:45:00,2009-12-01 07:45:00
3,489434,22041,"RECORD FRAME 7"" SINGLE SIZE",48,2009-12-01 07:45:00,2.10,13085,United Kingdom,07:45:00,2009-12-01 07:45:00
4,489434,21232,STRAWBERRY CERAMIC TRINKET BOX,24,2009-12-01 07:45:00,1.25,13085,United Kingdom,07:45:00,2009-12-01 07:45:00

In [26]:
combine_data_col_drop = combine_data.drop(columns=["InvoiceDate", "Time"])

KeyError: "['InvoiceDate', 'Time'] not found in axis"

In [27]:
combine_data.isnull().sum()

Invoice        15300
StockCode      74028
Description     8317
Quantity           0
Price              0
Customer ID        0
Country            0
Datetime           0
dtype: int64

In [ ]:
combine_data_dropna = combine_data_col_drop.dropna()

(1747037, 8)

In [27]:
df = pd.DataFrame({"name": ["luke", "smith", "ninian", "abigial"],
                   "age": [20, 34, 25, 25],
                   "height": [6.0, 6.3, 5.5, 5.5]})

In [28]:
df

      name  age  height
0     luke   20     6.0
1    smith   34     6.3
2   ninian   25     5.5
3  abigial   25     5.5

In [ ]:
for i in df["name"]:
    if i == "luke":
        df["name"] = i
print(df)

   name  age  height
0  luke   20     6.0
1  luke   34     6.3
2  luke   25     5.5
3  luke   25     5.5

In [30]:
df["Time2"] = df["name"].map(mapname)

NameError: name 'mapname' is not defined

In [184]:
df

,name,height,Time,cat,new_name,Time2
0,luke,6.1,12:14:00,good,0 24 1 28 2 34 3 37 4 29 Name: ...,12:14:00
1,Akuh,5.4,11:30:00,poor,,11:30:00
2,Mozizi,5.8,23:12:00,poor,0 24 1 28 2 34 3 37 4 29 Name: ...,23:12:00
3,Awuh,6.0,14:34:00,poor,0 24 1 28 2 34 3 37 4 29 Name: ...,14:34:00